foamfiles/counterFlowFlame2D/case_100/0/adapts/p_adapted.txt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0]; // Pa

internalField   uniform 1e5; // hmmm

boundaryField
{
    fuel
    {
        type            zeroGradient;
    }
    primary_air
    {
        type            zeroGradient;
    }
    secondary_air_RHS
    {
        type            zeroGradient;
    }  
    secondary_air_LHS
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        p0              $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
